#language: ru
Функция: Игра в дурака
  Как игрок, я хочу играть в дурака, чтобы побеждать соперников

  Сценарий: Начало игры
    Дано создана игра между "Alice" и "Bob"
    Когда игроки получают карты
    Тогда у каждого игрока должно быть по 6 карт

  Сценарий: Атака и защита
    Дано создана игра между "Alice" и "Bob"
    И Игроки получили начальные карты
    Когда "Alice" атакует "Bob"
    Тогда "Bob" должен попытаться защититься

  Сценарий: Окончание игры
    Дано создана игра между "Alice" и "Bob"
    Когда карты игроков заканчиваются
    Тогда игра должна завершиться

  Сценарий: Очередность хода
    Дано создана игра между "Alice" и "Bob"
    И Игроки получили начальные карты
    Когда "Alice" атакует "Bob"
    Тогда следующий ход должен сделать "Bob"
    И "Bob" должен атаковать "Alice"

  Сценарий: Пустая колода
    Дано создана игра между "Alice" и "Bob"
    И колода пуста
    Когда "Alice" пытается взять карту
    Тогда она не должна получать карту
